import React from "react";
import Layout from "../../components/Layout/Layout";

const DesAboutUs = () => {
  return (
    <Layout>
      <div className="rtl text-right p-4">
        <h1 className="text-2xl font-bold mb-4">درباره</h1>
        <p className="text-base leading-relaxed">
          سلام، ممنونم که از وب‌سایت فرانت کست بازدید می‌کنید.
          <br />
          <br />
          مسعود صدری هستم، مدرس و توسعه دهنده نرم افزار. برنامه نویسی را از حدود سال ۹۱، و فعالیت آموزشی را از سال ۹۴ با برگزاری کارگاه‌ها و دوره‌های برنامه نویسی شروع کردم. در طول این سال‌ها، نهایت تلاشم این بوده که دانش خودم را به روز کرده و با دیگران به اشتراک بگذارم.
          <br />
          <br />
          آموزش برنامه نویسی بدون شک یکی از بهترین فعالیت‌ها برای من است. بعد از چندین سال توسعه نرم افزار و تدریس حضوری، تا حد زیادی با دغدغه‌های دانشجوها و نیازهای بازار کار آشنا هستم. به همین دلیل در فرانت کست تلاش می‌کنم تا سرفصل‌های دوره‌ها کاملا به روز بوده و بر اساس نیازهای بازار کار طراحی شوند.
          <br />
          <br />
          در حال حاضر به صورت تمام وقت به تدریس برنامه نویسی مشغول هستم. همین طور در دانشکده مهندسی برق و کامپیوتر دانشگاه تبریز، کارگاه‌های درس‌های مبانی برنامه سازی و برنامه سازی پیشرفته را تدریس می‌کنم.
        </p>
      </div>
    </Layout>
  );
};

export default DesAboutUs;
