import React from "react";
import Layout from "../../components/Layout/Layout";

const TermsOfUse = () => {
  return (
    <Layout>
      <div className="rtl text-right p-4 md:p-6">
        <h2 className="text-xl md:text-2xl font-bold mb-4">شرایط استفاده</h2>
        <p className="text-base md:text-lg leading-relaxed mb-4">
          کاربر گرامی، ضمن تشکر از شما خواهشمندیم قبل از استفاده از خدمات فرانت
          کست، قوانین و مقررات وب‌سایت را مطالعه نمایید. لطفا توجه داشته باشید
          که ثبت نام در دوره‌های آموزشی تنها با پذیرش موارد درج شده در این صفحه
          امکان‌پذیر خواهد بود. فعالیت وب‌سایت فرانت کست بر اساس قوانین جمهوری
          اسلامی ایران انجام می‌شود. رعایت این قوانین دو طرفه بوده و از سوی
          کاربر نیز باید پذیرفته گردد.
        </p>
        <h2 className="text-xl md:text-2xl font-bold mb-4">قوانین حساب کاربری</h2>
        <p className="text-base md:text-lg leading-relaxed mb-4">
          – اشخاص حقیقی و حقوقی باید از اطلاعات صحیح و مشخصات هویتی واقعی خود در
          وب‌سایت فرانت کست استفاده کنند و در صورت تخلف، وب‌سایت هیچ گونه
          مسئولیتی در قبال این موضوع ندارد. – در صورتی که احراز گردد اشخاص حقیقی
          یا حقوقی با اطلاعات جعلی اقدام به استفاده از خدمات وب‌سایت کرده‌اند،
          فرانت کست می‌تواند نسبت به حذف و مسدودسازی حساب کاربری آنها اقدام کند
          و هیچ هزینه‌ای بابت این موضوع مسترد نخواهد گردید. – اطلاعات تماسی که
          کاربر در وب‌سایت ثبت می‌نماید مانند نام و نام خانوادگی، آدرس ایمیل و
          شماره تماس تنها اطلاعات موثقی است که وب‌سایت آن‌ها را به رسمیت
          می‌شناسد. فرانت کست تمام مکاتبات و پیگیری‌ها را از طریق همین اطلاعات
          تماس انجام می‌دهد و خود را در قبال اطلاعات تماس دیگری پاسخگو و مسئول
          نمی‌داند. – اشخاص نباید حساب کاربری خود را با هر هدفی در اختیار شخص یا
          اشخاص دیگری قرار دهند. فرانت کست فقط به شخصی که مالک حساب کاربری – با
          ایمیل مشخص – است خدمات خود را ارائه می‌دهد. – در صورتی که مشخص شود چند
          نفر به‌صورت هم‌زمان از یک حساب کاربری استفاده می‌نمایند، فرانت کست
          می‌تواند اقدامات قانونی لازم را نسبت به فرد و حساب کاربری مربوطه انجام
          دهد. – کاربران متعهد هستند تمام دوره‌های آموزشی که از فرانت کست
          خریداری می‌کنند را به‌صورت شخصی استفاده کنند و از به اشتراک گذاشتن
          آن‌ها در فضای آنلاین یا آفلاین، به‌صورت مستقیم یا با واسطه خودداری
          کنند. در صورت تخلف و انتشار یا انتقال دوره‌های آموزشی، فرانت کست حق
          پیگیری‌های قانونی و مسدودسازی حساب کاربری را برای خود محفوظ می‌دارد.
        </p>
        <h2 className="text-xl md:text-2xl font-bold mb-4">نظرات کاربران</h2>
        <p className="text-base md:text-lg leading-relaxed mb-4">
          – فرانت کست می‌تواند هر گونه دیدگاه و یا مطلبی که توسط کاربران منتشر
          شده و شامل محتوای مجرمانه یا بی‌احترامی است را حذف نماید. منظور از
          محتوای مجرمانه درج کامنت‌های توهین‌آمیز، نامناسب و… است که طبق قوانین
          جمهوری اسلامی ایران غیرقانونی محسوب می‌شود.
        </p>
        <h2 className="text-xl md:text-2xl font-bold mb-4">پشتیبانی دوره‌ها</h2>
        <p className="text-base md:text-lg leading-relaxed mb-4">
          – مدرس دوره‌های آموزشی در فرانت کست خود را موظف می‌داند تا به صورت
          کامل سوالات دانشجویان را در ساعات کاری و روزهای غیر تعطیل از طریق
          ایمیل و یا حساب تلگرام (نوشته شده در صفحه تماس) بررسی نماید. اولویت با
          سوالاتی خواهد بود که مربوط به رفع اشکال جلسات دوره‌ها می‌باشند.
        </p>
        <h2 className="text-xl md:text-2xl font-bold mb-4">پرداخت در سایت</h2>
        <p className="text-base md:text-lg leading-relaxed mb-4">
          – برای استفاده از دوره‌های غیر رایگان، کاربر ملزم به پرداخت هزینه آن
          به شکل پرداخت اینترنتی می‌باشد. کاربر موظف است برای پرداخت از کارت
          بانکی معتبر استفاده کند.
        </p>
        <h2 className="text-xl md:text-2xl font-bold mb-4">بازگشت وجه</h2>
        <p className="text-base md:text-lg leading-relaxed mb-4">
          – با توجه به انتشار رایگان بخش‌های متنوع در دوره‌های آموزشی غیر رایگان
          برای درک بهتر روند تدریس، بازگشت وجه تنها در صورت عدم تطابق سرفصل‌های
          درج شده در صفحه دوره با فایل‌های جلسات قابل دانلود در پنل کاربر انجام
          می‌شود.
        </p>
        <h2 className="text-xl md:text-2xl font-bold mb-4">امنیت وب‌سایت</h2>
        <p className="text-base md:text-lg leading-relaxed mb-4">
          – کاربر با عضویت در فرانت کست متعهد می‌شود تا هیچ گونه فعالیتی که باعث
          از کار افتادن، آسیب و حمله به وب‌سایت شود را انجام ندهد.
        </p>
        <h2 className="text-xl md:text-2xl font-bold mb-4">عدم رعایت قوانین</h2>
        <p className="text-base md:text-lg leading-relaxed mb-4">
          – در صورت عدم رعایت قوانین درج شده در این صفحه، فرانت کست این حق را
          برای خود محفوظ می‌دارد که بلافاصله دسترسی کاربر به وب‌سایت را معلق یا
          به طور کلی مسدود کند.
        </p>
      </div>
    </Layout>
  );
};

export default TermsOfUse;
